README.org
#+TITLE: ResignXcode
#+AUTHOR: slegetank
#+OPTIONS: \n:\n

* ResignXcode
This little script's purpose is just for resign Xcode with a self-signed certificate.
From Xcode8, apple just stops the use of plugins to give programmers more security. This is really inconvenience for me. Everytime Xcode updates, I have to resign Xcode mannually to continue use so much good plugins[[https://github.com/XVimProject/XVim/blob/master/INSTALL_Xcode8.md][(Manual From XVim)]]. So, this weapon is born.
* Use 
#+BEGIN_SRC python
python ResignXcode.py
#+END_SRC
* You should know
1. If you don't know what's going on with this script, then don't use it, because it'll put you under risk.
2. You can read the code to decide if you want to use it.
* Simple explain 
1. Use openssl to generate 2048 RSA self-signed certificate.
2. Import the cer into your keychain.
3. Resign your Xcode.
* Other things
+ Good app: https://github.com/fpg1503/MakeXcodeGr8Again#should-i-use-it
+ Discuss: https://github.com/alcatraz/Alcatraz/issues/475
+ openssl req file format: https://wiki.openssl.org/index.php/Manual:Req(1)
+ Generate right self-signed cer: http://security.stackexchange.com/questions/17909/how-to-create-an-apple-installer-package-signing-certificate?answertab=votes#tab-top
